#Can you fix my code?

I tried to complete yesterday's project, but I have so many errors!  Can you find and fix them all?

# Let's continue to explore feature engineering with the Ames Housing data.  Import the dataset and name it "house".

###1) Import the Ames Housing Data here: https://raw.githubusercontent.com/ryanleeallred/datasets/master/Ames%20Housing%20Data/train.csv

In [4]:
import pandas as pd

house = pd.read_csv('https://raw.githubusercontent.com/ryanleeallred/datasets/master/Ames%20Housing%20Data/train.csv')

###2) Print the first five rows of the house dataset.

In [6]:
house.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

###3) Create a new variable called Large_Lot that takes on the value 1 when LotArea is gerater than or equal to 10,000 and the value 0 when LotArea is less than 10,000.

In [12]:
house.loc[house['LotArea'] >= 10000, 'Large_Lot'] = 1
house.loc[house['LotArea'] < 10000, 'Large_Lot'] = 0

house[['LotArea', 'Large_Lot']]

      LotArea  Large_Lot
0        8450        0.0
1        9600        0.0
2       11250        1.0
3        9550        0.0
4       14260        1.0
...       ...        ...
1455     7917        0.0
1456    13175        1.0
1457     9042        0.0
1458     9717        0.0
1459     9937        0.0

[1460 rows x 2 columns]

###4) Create a new variable called Total_Bathrooms that contains the total number of full and half bathrooms in the house.

In [11]:
house['Total_Bathrooms'] = house['BsmtFullBath'] + house['BsmtHalfBath'] + house['FullBath'] + house['HalfBath']

print(house[['Total_Bathrooms','BsmtFullBath','BsmtHalfBath','FullBath','HalfBath']])

      Total_Bathrooms  BsmtFullBath  BsmtHalfBath  FullBath  HalfBath
0                   4             1             0         2         1
1                   3             0             1         2         0
2                   4             1             0         2         1
3                   2             1             0         1         0
4                   4             1             0         2         1
...               ...           ...           ...       ...       ...
1455                3             0             0         2         1
1456                3             1             0         2         0
1457                2             0             0         2         0
1458                2             1             0         1         0
1459                3             1             0         1         1

[1460 rows x 5 columns]

###5) Create a new variable called Summer_Sale that equals 1 if the sale month was in June, July or August ( MoSold = 6, 7 or 8) and 0 if the sale month was in September - May.

In [14]:
house.loc[(house['MoSold'] >= 6 ) & (house['MoSold'] <= 8 ), 'Summer_Sale'] = 1 

house.loc[(house['MoSold'] < 6) | (house['MoSold'] > 8), 'Summer_Sale'] = 0  

house[['MoSold', 'Summer_Sale']]

      MoSold  Summer_Sale
0          2          0.0
1          5          0.0
2          9          0.0
3          2          0.0
4         12          0.0
...      ...          ...
1455       8          1.0
1456       2          0.0
1457       5          0.0
1458       4          0.0
1459       6          1.0

[1460 rows x 2 columns]

#Now we'll revisit the LendingClub data.

Remember to import the data by first unzipping the file:

In [15]:
!wget https://resources.lendingclub.com/LoanStats_2018Q4.csv.zip

zsh:1: command not found: wget

In [16]:
!unzip LoanStats_2018Q4.csv.zip

unzip:  cannot find or open LoanStats_2018Q4.csv.zip, LoanStats_2018Q4.csv.zip.zip or LoanStats_2018Q4.csv.zip.ZIP.

In [92]:
# Read in the CSV
# import pandas as pd
df = pd.read_csv('LoanStats_2018Q4.csv.zip', skiprows = 1)
df = df[0 : 128412]
print(df.shape)

df.head()
df.tail()

(128412, 144)

/Users/jeffkang/.pyenv/versions/3.8.5/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3441: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,orig_projected_additional_accrued_interest,hardship_payoff_balance_amount,hardship_last_payment_amount,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
128407,NaN,NaN,23000.0,23000.0,23000.0,36 months,15.02%,797.53,C,C3,...,NaN,NaN,NaN,N,NaN,NaN,NaN,NaN,NaN,NaN
128408,NaN,NaN,10000.0,10000.0,10000.0,36 months,15.02%,346.76,C,C3,...,NaN,NaN,NaN,N,NaN,NaN,NaN,NaN,NaN,NaN
128409,NaN,NaN,5000.0,5000.0,5000.0,36 months,13.56%,169.83,C,C1,...,NaN,NaN,NaN,N,NaN,NaN,NaN,NaN,NaN,NaN
128410,NaN,NaN,10000.0,10000.0,9750.0,36 months,11.06%,327.68,B,B3,...,NaN,NaN,NaN,N,NaN,NaN,NaN,NaN,NaN,NaN
128411,NaN,NaN,10000.0,10000.0,10000.0,36 months,16.91%,356.08,C,C5,...,NaN,NaN,NaN,N,NaN,NaN,NaN,NaN,NaN,NaN

#Approaching a problem two different ways.

In the guided project, we learned how to find the earliest credit year using the built-in pandas date-time format.  However, there is often more than one way to come up with the same solution.


In the following questions we will work through the steps to create a new variables called Earliest_Credit_Year and issue_year where we use the .split() function remove the month report back just the year as a float data type.  Then we'll use those variables to calculate the length of credit history in years.

If we do everything correctly, we should calculate *about* the same length of longest credit history that we did in class working with the date-time format.  The answers won't exactly match because we are making different assumptions about when in each month and year the loans were taken out, but it will give you a flavor for different ways of approaching the same problem.

###6) Create a simple test case where credit = 'Jun-1979'.  

Use the .split('-') function to separate the month and year parts of the data and print the year.

Hint: Name the results of the .split('-') function "fields".  fields[0] will return the month part of the date and fields[1] will return the year part of the date.

In [93]:
credit = 'Jun-1979'

fields = credit.split('-')

month = fields[0]
year = fields[1]

print(float(year))

1979.0

###7) Use your answer in 6) to write a function called credit_yr that takes in the contents of a cell formatted 'month-year' and returns the year.

Run your function using the simple test case in 6).

In [94]:
def credit_yr(cell_contents):
  fields = cell_contents.split('-')
  month = fields[0]
  year = fields[1]
  year = float(year)
  return year

credit_yr(credit)

df.head()
df.shape

(128412, 144)

###8) Use the .apply() function to apply the function to every cell in the earliest_cr_line variable.

In [95]:
df['Earliest_Credit_Year'] = df['earliest_cr_line'].apply(credit_yr)

###9) Print the top 5 rows of the Earliest_Credit_Year and earliest_cr_line variables to make sure the variables were created correctly.

In [96]:
df[['Earliest_Credit_Year','earliest_cr_line']].head()

   Earliest_Credit_Year earliest_cr_line
0                1998.0         Mar-1998
1                2002.0         Sep-2002
2                2010.0         Sep-2010
3                2014.0         Apr-2014
4                2007.0         Mar-2007

### 10) Use your function to create a new variable called Issue_Year from the issue_d variable.

In [97]:
df['Issue_Year'] = df['issue_d'].apply(credit_yr)

df[['Issue_Year','issue_d']].head()

   Issue_Year   issue_d
0      2018.0  Dec-2018
1      2018.0  Dec-2018
2      2018.0  Dec-2018
3      2018.0  Dec-2018
4      2018.0  Dec-2018

###11) Caluculate length of credit history in years and in days.

Hint: If you are getting an error message, make sure to check the data type of the years output by your functions.

In [101]:
df['Credit_History_Years'] = df['Issue_Year'] - df['Earliest_Credit_Year']
df['Credit_History_Days'] = df['Credit_History_Years'] * 365.25

df[['Issue_Year','Earliest_Credit_Year','Credit_History_Years','Credit_History_Days']].head()

   Issue_Year  Earliest_Credit_Year  Credit_History_Years  Credit_History_Days
0      2018.0                1998.0                  20.0              7305.00
1      2018.0                2002.0                  16.0              5844.00
2      2018.0                2010.0                   8.0              2922.00
3      2018.0                2014.0                   4.0              1461.00
4      2018.0                2007.0                  11.0              4017.75

###12) Calculate the maximum credit length and compare it to we got in the guided project.  

Note - it won't be *exactly* the same because both methods are working in different ways, but they will give you a "pretty close" answer.

In [106]:
df['Credit_History_Years'].max()

68.0